assignment-12/assignment.org
# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Assignment 12, Data-Structures
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2016-03-28 Mon>
#+DESCRIPTION: First assignment in the course Data-Structures
#+KEYWORDS: Data-Structures, Algorithms, Assignment
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{pgf}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{shapes,backgrounds}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \usepackage{algpseudocode}
#+LATEX_HEADER: \usepackage{algorithm}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \renewcommand{\arraystretch}{1.6}

#+BEGIN_SRC emacs-lisp :exports none
  (setq org-latex-pdf-process
        '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -f %f")
        org-latex-listings t
        org-src-fontify-natively t
        org-babel-latex-htlatex "htlatex")

  (defmacro by-backend (&rest body)
    `(progn
       (cl-case org-export-current-backend ,@body)))

  ;; (defmacro by-backend (&rest body)
  ;;   `(cl-case (when (boundp 'backend)
  ;;               (org-export-backend-name backend))
  ;;      ,@body))
#+END_SRC

#+RESULTS:
: by-backend

#+BEGIN_LATEX
\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\definecolor{codestr}{rgb}{0.46,0.09,0.2}
\lstset{%
  backgroundcolor=\color{codebg},
  basicstyle=\ttfamily\scriptsize,
  breakatwhitespace=false,
  breaklines=false,
  captionpos=b,
  framexleftmargin=10pt,
  xleftmargin=10pt,
  framerule=0pt,
  frame=tb,
  keepspaces=true,
  keywordstyle=\color{blue},
  showspaces=false,
  showstringspaces=false,
  showtabs=false,
  stringstyle=\color{codestr},
  tabsize=2
}
\lstnewenvironment{maxima}{%
  \lstset{%
    backgroundcolor=\color{codebg},
    escapeinside={(*@}{@*)},
    aboveskip=20pt,
    captionpos=b,
    label=,
    caption=,
    showstringspaces=false,
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\clearpage
#+END_LATEX

* Problems

** Problem 1
   Find tight bounds on the given recurrences.  Assume $T(n)$ is constant for $n
   = 1$.

   #+HEADER: :exports results
   #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
   #+BEGIN_SRC latex
     \begin{align*}
       T(n) &= 8T\left(\frac{n}{2}\right) + n + n^3 \\
       T(n) &= kT\left(\frac{n}{2}\right) + (k - 2)n^3 \\
       &\textit{where}\; k \in \mathbb{Z}: k \geq 2 \\
       T(n) &= 2T\left(\frac{n}{4}\right) + \sqrt{n} \times \lg n \\
       T(n) &= T\left(n - 1\right) + n \lg n + n \\
       T(n) &= n^2 \sqrt{n} \times T\left(\sqrt{n}\right) + n^5 \lg^3 n + \lg^5 n
     \end{align*}
   #+END_SRC

*** Answer 1
    Using conclusion from master method theorem:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 8T\left(\frac{n}{2}\right) + n + n^3 \iff \\
        f(n) &= n + n^3 \\
        a &= 8 \\
        b &= 2 \\
        n^{\log_b a} = n^{\log_2 8} &= n^3 < n + n^3\;.
      \end{align*}
    #+END_SRC
    However, asymptotically, only the $n^3$ term matters, thus $T(n) =
    \Theta(n^3)$, viz. second case of master method.

*** Answer 2

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= kT\left(\frac{n}{2}\right) + (k - 2)n^3 \\
             &\textit{where}\; k \in \mathbb{Z}: k \geq 2 \\
             &= k\left(kT\left(\frac{n}{4}\right) + \frac{(k - 2)n^3}{2}\right) + (k - 2)n^3 \\
             &= k^2T\left(\frac{n}{4}\right) + \frac{(k + 2)(k - 2)n^3}{2} \\
             &= k^2\left(kT\left(\frac{n}{8}\right) + \frac{(k + 2)(k - 2)n^3}{8}\right) + \frac{(k + 2)(k - 2)n^3}{2} \\
             &= k^3T\left(\frac{n}{8}\right) + \frac{(k^2 + 4)(k + 2)(k - 2)n^3}{8} \\
             &= k^3T\left(\frac{n}{8}\right) + \frac{(k^2 + 4)(k^2 - 4)n^3}{8} \\
             &\dots \\
             &= k^iT\left(\frac{n}{2^i}\right) + \frac{(k^i - 2^i)n^3}{2^i}
      \end{align*}
    #+END_SRC

    The recursion ends when $i = \lg n$, and at this point the $T(1)$ vanishes,
    and we are left with:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
         \frac{(k^i - 2^i)n^3}{2^i} &= \left(\frac{k}{2}\right)^in^3 - n^3 \\
         &\approx \left(\frac{k}{2}\right)^in^3 \\
         &= \left(\frac{k}{2}\right)^{\lg n}n^3 \\
         &\textit{Using}\; 2^{\lg n} = n \\
         &\approx n^4\;.
      \end{align*}
    #+END_SRC

    Thus $T(n) = O(n^4)$.

*** Answer 3
    Using conclusion from master method theorem:
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 2T\left(\frac{n}{4}\right) + \sqrt{n} \lg n \iff \\
        f(n) &= \sqrt{n} \lg n \\
        a &= 2 \\
        b &= 4 \\
        n^{\log_b a} = n^{\log_4 2} &= \sqrt{n} < \sqrt{n} \lg n\;.
      \end{align*}
    #+END_SRC

    This is the first case of master method, i.e. most work is done at the root
    (at each step we look at two of the four sub-problems).  The amount of work
    done at each recursion step is $\sqrt{n}\times \lg n$ which is roughly the
    same as just $n$ since $\lg n = O(\sqrt{n})$.  Hence $T(n) = O(n)$.

*** Answer 4

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= T(n - 1) + n \lg n + n \\
             &= \sum_{i = 1}^n(i + i \lg i) \\
             &= \sum_{i = 1}^ni(1 + \lg i) \\
             &= \frac{n(n + 1)}{2} \times \sum_{i = 1}^n(1 + \lg i) \\
             &= \frac{n(n + 1)}{2} \times \left(n + \sum_{i = 1}^n \lg i \right) \\
             &= \frac{n(n + 1)(n + \lg n!)}{2} \\
             &\textit{using Stirling approximation} \\
             &\approx \frac{n(n + 1)(n + n \lg n - n)}{2} \\
             &= \frac{n^2 \lg n(n + 1)}{2} \\
             &\approx \frac{n^3 \lg n}{2} \;.
      \end{align*}
    #+END_SRC

    Since constant factors are of no interest to us, we conclude $T(n) = O(n^3
    \lg n)$.
    
*** Answer 5

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= n^2 \sqrt{n} T\left(\sqrt{n}\right) + n^5 \lg^3 n + \lg^5 n \\
             &= n^{\frac{5}{2}} T\left(n^{\frac{1}{2}}\right) + n^5 \lg^3 n + \lg^5 n \\
             &= n^{i\frac{5}{2}} T\left(n^{\frac{1}{i2}}\right) + \sum_{j=1}^i(n^5 \lg^3 n + \lg^5 n)^{\frac{1}{j}} \\
             &\textit{Recursion terminates when}\; n^{\frac{1}{i2}} = 1\;.
      \end{align*}
    #+END_SRC

** Problem 2
   Find upper and lower bounds on:

   #+HEADER: :exports results
   #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
   #+BEGIN_SRC latex
     \begin{align*}
       T(n) &= 2T(\frac{n}{2}) + n^3 \\
       T(n) &= T(\frac{9n}{10}) + n \\
       T(n) &= 16T(\frac{n}{4}) + n^2 \\
       T(n) &= 7T(\frac{n}{3}) + n^2 \\
       T(n) &= 7T(\frac{n}{2}) + n^2 \\
       T(n) &= 2T(\frac{n}{4}) + \sqrt{n} \\
       T(n) &= T(n - 1) + n \\
       T(n) &= T(\sqrt{n}) + 1
     \end{align*}
   #+END_SRC

