assignment-12/assignment.tex
% Created 2016-04-04 Mon 23:54
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[hidelinks]{hyperref}
\tolerance=1000
\usepackage[utf8]{inputenc}
\usepackage{commath}
\usepackage{pgf}
\usepackage{tikz}
\usetikzlibrary{shapes,backgrounds}
\usepackage{marginnote}
\usepackage{listings}
\usepackage{enumerate}
\usepackage{algpseudocode}
\usepackage{algorithm}
\usepackage{mathtools}
\setlength{\parskip}{16pt plus 2pt minus 2pt}
\renewcommand{\arraystretch}{1.6}
\author{Oleg Sivokon}
\date{\textit{<2016-03-28 Mon>}}
\title{Assignment 12, Data-Structures}
\hypersetup{
 pdfauthor={Oleg Sivokon},
 pdftitle={Assignment 12, Data-Structures},
 pdfkeywords={Data-Structures, Algorithms, Assignment},
 pdfsubject={First assignment in the course Data-Structures},
 pdfcreator={Emacs 25.0.50.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\definecolor{codebg}{rgb}{0.96,0.99,0.8}
\definecolor{codestr}{rgb}{0.46,0.09,0.2}
\lstset{%
  backgroundcolor=\color{codebg},
  basicstyle=\ttfamily\scriptsize,
  breakatwhitespace=false,
  breaklines=false,
  captionpos=b,
  framexleftmargin=10pt,
  xleftmargin=10pt,
  framerule=0pt,
  frame=tb,
  keepspaces=true,
  keywordstyle=\color{blue},
  showspaces=false,
  showstringspaces=false,
  showtabs=false,
  stringstyle=\color{codestr},
  tabsize=2
}
\lstnewenvironment{maxima}{%
  \lstset{%
    backgroundcolor=\color{codebg},
    escapeinside={(*@}{@*)},
    aboveskip=20pt,
    captionpos=b,
    label=,
    caption=,
    showstringspaces=false,
    frame=single,
    framerule=0pt,
    basicstyle=\ttfamily\scriptsize,
    columns=fixed}}{}
}
\makeatletter
\newcommand{\verbatimfont}[1]{\renewcommand{\verbatim@font}{\ttfamily#1}}
\makeatother
\verbatimfont{\small}%
\clearpage

\section{Problems}
\label{sec:orgheadline16}

\subsection{Problem 1}
\label{sec:orgheadline6}
Find tight bounds on the given recurrences.  Assume \(T(n)\) is constant for \(n
   = 1\).

\begin{align*}
  T(n) &= 8T\left(\frac{n}{2}\right) + n + n^3 \\
  T(n) &= kT\left(\frac{n}{2}\right) + (k - 2)n^3 \\
  &\textit{where}\; k \in \mathbb{Z}: k \geq 2 \\
  T(n) &= 2T\left(\frac{n}{4}\right) + \sqrt{n} \times \lg n \\
  T(n) &= T\left(n - 1\right) + n \lg n + n \\
  T(n) &= n^2 \sqrt{n} \times T\left(\sqrt{n}\right) + n^5 \lg^3 n + \lg^5 n
\end{align*}

\subsubsection{Answer 1}
\label{sec:orgheadline1}
Using conclusion from master method theorem:

\begin{align*}
  T(n) &= 8T\left(\frac{n}{2}\right) + n + n^3 \iff \\
  f(n) &= n + n^3 \\
  a &= 8 \\
  b &= 2 \\
  n^{\log_b a} = n^{\log_2 8} &= n^3 < n + n^3\;.
\end{align*}

However, asymptotically, only the \(n^3\) term matters, thus \(T(n) =
    \Theta(n^3)\), viz. second case of master method.

\subsubsection{Answer 2}
\label{sec:orgheadline2}

\begin{align*}
  T(n) &= kT\left(\frac{n}{2}\right) + (k - 2)n^3 \\
       &\textit{where}\; k \in \mathbb{Z}: k \geq 2 \\
       &= k\left(kT\left(\frac{n}{4}\right) + \frac{(k - 2)n^3}{2}\right) + (k - 2)n^3 \\
       &= k^2T\left(\frac{n}{4}\right) + \frac{(k + 2)(k - 2)n^3}{2} \\
       &= k^2\left(kT\left(\frac{n}{8}\right) + \frac{(k + 2)(k - 2)n^3}{8}\right) + \frac{(k + 2)(k - 2)n^3}{2} \\
       &= k^3T\left(\frac{n}{8}\right) + \frac{(k^2 + 4)(k + 2)(k - 2)n^3}{8} \\
       &= k^3T\left(\frac{n}{8}\right) + \frac{(k^2 + 4)(k^2 - 4)n^3}{8} \\
       &\dots \\
       &= k^iT\left(\frac{n}{2^i}\right) + \frac{(k^i - 2^i)n^3}{2^i}
\end{align*}

The recursion ends when \(i = \lg n\), and at this point the \(T(1)\) vanishes,
and we are left with:

\begin{align*}
   \frac{(k^i - 2^i)n^3}{2^i} &= \left(\frac{k}{2}\right)^in^3 - n^3 \\
   &\approx \left(\frac{k}{2}\right)^in^3 \\
   &= \left(\frac{k}{2}\right)^{\lg n}n^3 \\
   &\textit{Using}\; 2^{\lg n} = n \\
   &\approx n^4\;.
\end{align*}

Thus \(T(n) = O(n^4)\).

\subsubsection{Answer 3}
\label{sec:orgheadline3}
Using conclusion from master method theorem:

\begin{align*}
  T(n) &= 2T\left(\frac{n}{4}\right) + \sqrt{n} \lg n \iff \\
  f(n) &= \sqrt{n} \lg n \\
  a &= 2 \\
  b &= 4 \\
  n^{\log_b a} = n^{\log_4 2} &= \sqrt{n} < \sqrt{n} \lg n\;.
\end{align*}

This is the first case of master method, i.e. most work is done at the root
(at each step we look at two of the four sub-problems).  The amount of work
done at each recursion step is \(\sqrt{n}\times \lg n\) which is roughly the
same as just \(n\) since \(\lg n = O(\sqrt{n})\).  Hence \(T(n) = O(n)\).

\subsubsection{Answer 4}
\label{sec:orgheadline4}

\begin{align*}
  T(n) &= T(n - 1) + n \lg n + n \\
       &= \sum_{i = 1}^n(i + i \lg i) \\
       &= \sum_{i = 1}^ni(1 + \lg i) \\
       &= \frac{n(n + 1)}{2} \times \sum_{i = 1}^n(1 + \lg i) \\
       &= \frac{n(n + 1)}{2} \times \left(n + \sum_{i = 1}^n \lg i \right) \\
       &= \frac{n(n + 1)(n + \lg n!)}{2} \\
       &\textit{using Stirling approximation} \\
       &\approx \frac{n(n + 1)(n + n \lg n - n)}{2} \\
       &= \frac{n^2 \lg n(n + 1)}{2} \\
       &\approx \frac{n^3 \lg n}{2} \;.
\end{align*}

Since constant factors are of no interest to us, we conclude \(T(n) = O(n^3
    \lg n)\).

\subsubsection{Answer 5}
\label{sec:orgheadline5}

\begin{align*}
  T(n) &= n^2 \sqrt{n} T\left(\sqrt{n}\right) + n^5 \lg^3 n + \lg^5 n \\
       &= n^{\frac{5}{2}} T\left(n^{\frac{1}{2}}\right) + n^5 \lg^3 n + \lg^5 n \\
       &= n^{i\frac{5}{2}} T\left(n^{\frac{1}{i2}}\right) + \sum_{j=1}^i(n^5 \lg^3 n + \lg^5 n)^{\frac{1}{j}} \\
       &\textit{Recursion terminates when}\; n^{\frac{1}{i2}} = 1\;.
\end{align*}

\subsection{Problem 2}
\label{sec:orgheadline8}
Find upper and lower bounds on:

\begin{align*}
  T(n) &= 2T(\frac{n}{2}) + n^3 \\
  T(n) &= T(\frac{9n}{10}) + n \\
  T(n) &= 16T(\frac{n}{4}) + n^2 \\
  T(n) &= 7T(\frac{n}{3}) + n^2 \\
  T(n) &= 7T(\frac{n}{2}) + n^2 \\
  T(n) &= 2T(\frac{n}{4}) + \sqrt{n} \\
  T(n) &= T(n - 1) + n \\
  T(n) &= T(\sqrt{n}) + 1
\end{align*}
