assignment-12/assignment.org
*** Answer 6
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 2T(\frac{n}{2}) + n^3 \\
        &\textit{Using master method} \\
        a &= 2 \\
        b &= 2 \\
        f(n) &= n^3 \\
        n^{\log_2 2} &= n < n^3 \\
        &\textit{Third case of master method, hence} \\
        T(n) &= \Theta(f(n)) = \Theta(n^3)
      \end{align*}
    #+END_SRC

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= T(\frac{9n}{10}) + n \\
        T(n) &= 9T(\frac{n}{10}) + n \\
        &\textit{Using master method} \\
        a &= 9 \\
        b &= 10 \\
        f(n) &= n \\
        n^{\log_9 10} &\approx n^{1.05} \approx n \\
        &\textit{Second case of master method, hence} \\
        T(n) &= \Theta(n^{1.05}\lg n) \approx \Theta(n\lg n)
      \end{align*}
    #+END_SRC

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 16T(\frac{n}{4}) + n^2 \\
        &\textit{Using master method} \\
        a &= 16 \\
        b &= 4 \\
        f(n) &= n^2 \\
        n^{\log_4 16} &= n^2 = n^2 \\
        &\textit{Second case of master method, hence} \\
        T(n) &= \Theta(n^2\lg n)
      \end{align*}
    #+END_SRC

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 7T(\frac{n}{3}) + n^2 \\
        &\textit{Using master method} \\
        a &= 7 \\
        b &= 3 \\
        f(n) &= n^2 \\
        n^{\log_3 7} &\approx n^{1.8} \approx n^2 \\
        &\textit{Second case of master method, hence} \\
        T(n) &= \Theta(n^2\lg n)
      \end{align*}
    #+END_SRC

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 7T(\frac{n}{2}) + n^2 \\
        &\textit{Using master method} \\
        a &= 7 \\
        b &= 2 \\
        f(n) &= n^2 \\
        n^{\log_2 7} &\approx n^{2.8} > n^2 \\
        &\textit{First case of master method, hence} \\
        T(n) &= \Theta(n^{2.8}) \approx \Theta(n^3)
      \end{align*}
    #+END_SRC

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= 2T(\frac{n}{4}) + \sqrt{n} \\
        T(n) &= 2T(\frac{n}{4}) + n^{\frac{1}{2}} \\
        &\textit{Using master method} \\
        a &= 2 \\
        b &= 4 \\
        f(n) &= n^{\frac{1}{2}} \\
        n^{\log_4 2} &= n^{\frac{1}{2}} = n^{\frac{1}{2}} \\
        &\textit{Second case of master method, hence} \\
        T(n) &= \Theta(\sqrt{n} \lg n)
      \end{align*}
    #+END_SRC
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= T(n - 1) + n \\
        &\textit{Suppose} \\
        T(1) &= 1 \\
        &\textit{Then} \\
        T(n) &= T(1) + 2 + 3 + \dots + n = \frac{n(n + 1)}{2} \approx n^2 \\
        T(n) &= \Theta(n^2)
      \end{align*}
    #+END_SRC
    
    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{align*}
        T(n) &= T(\sqrt{n}) + 1 \\
        T(n) &= T(n^{\frac{1}{2}}) + 1 \\
             &= T(n^{\frac{1}{4}}) + 1 + 1 \\
             &= T(n^{\frac{1}{8}}) + 1 + 1 + 1 \\
             &= T(n^{\frac{1}{\lg i}}) + i \\
             &= \lg n \\
             &= \Theta(\lg n)
      \end{align*}
    #+END_SRC

** Problem 3
   Suggest a data-structure with the following properties:
   1. Populate in $O(n)$ time.
   2. Insert in $O(n \lg n)$ time.
   3. Extract minimal element in $O(\lg n)$ time.
   4. Extract median element in $O(\lg n)$ time.
   5. Extract maximal element in $O(\lg n)$ time.

*** Answer 6
    There is a simple, but impractical way of doing this---have four heaps:
    - $A$ is a =min-heap= containing elements greater than median.
    - $B$ is a =max-heap= containing elments smaller than median.
    - $C$ is a =max-heap= tracking the heap $A$.
    - $D$ is a =min-heap= tracking the heap $B$.

    Creation and insertion are essentially the same as they are in the regular
    =max-heap= and =mean-heap=.  Median element is either the root of $A$ or the
    root of $B$, depending on which heap has more elements.  Maximum element is
    the root of $C$ and minimal element is the root of $D$, so their extraction
    is just the glorified =extract-max= and =extract-min= correspondingly.

    Tracking is achieved using the following mechanism: Each node in each heap
    has an additional field that has a position of the tracked node in the other
    heap in it.  Once the position of the node is modified, in addition to
    =heapify-min= or =heapify-max=, the procedure also updates the index in the
    tracking node (this takes only constant time).

    Whenever a node is deleted, it also needs to be deleted from the tracking
    heap.  In this case, the rightmost element in the heap is placed in the cell
    previously occupied by the node being deleted.  Then =heapify-min= or
    =heapify-max= is performed, depending on the kind of heap it was.

    Note that this solution is impractical since it requires saving a lot of
    additional information, but if we were to relax the requirement of $O(n)$
    allowing $O(n \lg n)$ for population, then we could use something like
    order-statistic tree.

** Problem 4
   1. Given binary heap $A$ of size $n$ prove that =extract-max= requires
      roughly $2\lg n$ comparisons.
   2. Write an alternative =extract-max= which only uses $\lg n + \lg \lg n +
      O(1)$ comparisons.
   3. Improve the previous =extrac-max= s.t. its running time is $\lg n + \lg
      \lg \lg n + O(1)$ wrt. comparisons.
   4. Is it possible to improve this procedure further?  Is it worth it wrt. the
      amount of code that it requires?

*** Answer 7
    First, recall what =extract-max= looks like:

    #+HEADER: :exports results
    #+HEADER: :results (by-backend (pdf "latex") (t "raw"))
    #+BEGIN_SRC latex
      \begin{algorithm}
        \caption{Running time of extract-max}
        \begin{algorithmic}
          \Procedure {$\textit{extract-max}$}{$heap$}
          \State {$max \leftarrow $}{$heap_0$}
          \State \Call {$size \leftarrow \textit{size}$}{$heap$}
          \State {$last \leftarrow $}{$heap_{size - 1}$}
          \State {$heap_{size - 1} \leftarrow $}{$nil$}
          \State \Call {$\textit{heapify-max}$}{$heap, size - 1$}
          \State \Return {$max$}
          \EndProcedure

          \Procedure {$\textit{heapify-max}$}{$heap, child$}
          \State {$left \leftarrow $}{$child * 2 - 1$}
          \State {$right \leftarrow $}{$child * 2$}
          \State {$parent \leftarrow $}{$child$}
          \State \Call {$size \leftarrow \textit{size}$}{$heap$}
          \If {$left < size \land heap_{left} > heap_{parent}$} \Then
          \State {$parent \leftarrow $}{$left$}
          \EndIf
          \If {$right < size \land heap_{right} > heap_{parent}$} \Then
          \State {$parent \leftarrow $}{$right$}
          \EndIf
          \If {$parent \neq child$} \Then
          \State {$heap_{i},heap_{parent} \leftarrow $}{$heap_{parent},heap_{i}$}
          \State \Call {$\textit{heapify-max}$}{$heap, parent$}
          \EndIf
          \EndProcedure
        \end{algorithmic}
      \end{algorithm}
    #+END_SRC

    The comparisons all happen inside the =heapify-max=, notice that it is
    called recursively on the problem of size $n$, splitting it into two
    equally-sized portions, and only working on the selected subtree.  It will
    only look once at a node at the $h^s$ level $h$ being the heights of the
    heap.  At each such level it will do five comparisons: two to ensure that
    all reads fall within the valid range, two more to find the maximal element
    of the parent and its two sibling nodes, and the last one to figure out
    whether an additional =heapify-max= call is required.

    Thus, somewhat contrary to conjectured, the number of comparisons required
    is actually $5\lg n$, but only $2\lg n$ of them are between the members of
    the heap (the rest is borders checking).

