assignment-12/assignment.tex

\subsubsection{Answer 6}
\label{sec:orgheadline7}
\begin{align*}
  T(n) &= 2T(\frac{n}{2}) + n^3 \\
  &\textit{Using master method} \\
  a &= 2 \\
  b &= 2 \\
  f(n) &= n^3 \\
  n^{\log_2 2} &= n < n^3 \\
  &\textit{Third case of master method, hence} \\
  T(n) &= \Theta(f(n)) = \Theta(n^3)
\end{align*}

\begin{align*}
  T(n) &= T(\frac{9n}{10}) + n \\
  T(n) &= 9T(\frac{n}{10}) + n \\
  &\textit{Using master method} \\
  a &= 9 \\
  b &= 10 \\
  f(n) &= n \\
  n^{\log_9 10} &\approx n^{1.05} \approx n \\
  &\textit{Second case of master method, hence} \\
  T(n) &= \Theta(n^{1.05}\lg n) \approx \Theta(n\lg n)
\end{align*}

\begin{align*}
  T(n) &= 16T(\frac{n}{4}) + n^2 \\
  &\textit{Using master method} \\
  a &= 16 \\
  b &= 4 \\
  f(n) &= n^2 \\
  n^{\log_4 16} &= n^2 = n^2 \\
  &\textit{Second case of master method, hence} \\
  T(n) &= \Theta(n^2\lg n)
\end{align*}

\begin{align*}
  T(n) &= 7T(\frac{n}{3}) + n^2 \\
  &\textit{Using master method} \\
  a &= 7 \\
  b &= 3 \\
  f(n) &= n^2 \\
  n^{\log_3 7} &\approx n^{1.8} \approx n^2 \\
  &\textit{Second case of master method, hence} \\
  T(n) &= \Theta(n^2\lg n)
\end{align*}

\begin{align*}
  T(n) &= 7T(\frac{n}{2}) + n^2 \\
  &\textit{Using master method} \\
  a &= 7 \\
  b &= 2 \\
  f(n) &= n^2 \\
  n^{\log_2 7} &\approx n^{2.8} > n^2 \\
  &\textit{First case of master method, hence} \\
  T(n) &= \Theta(n^{2.8}) \approx \Theta(n^3)
\end{align*}

\begin{align*}
  T(n) &= 2T(\frac{n}{4}) + \sqrt{n} \\
  T(n) &= 2T(\frac{n}{4}) + n^{\frac{1}{2}} \\
  &\textit{Using master method} \\
  a &= 2 \\
  b &= 4 \\
  f(n) &= n^{\frac{1}{2}} \\
  n^{\log_4 2} &= n^{\frac{1}{2}} = n^{\frac{1}{2}} \\
  &\textit{Second case of master method, hence} \\
  T(n) &= \Theta(\sqrt{n} \lg n)
\end{align*}


\begin{align*}
  T(n) &= T(n - 1) + n \\
  &\textit{Suppose} \\
  T(1) &= 1 \\
  &\textit{Then} \\
  T(n) &= T(1) + 2 + 3 + \dots + n = \frac{n(n + 1)}{2} \approx n^2 \\
  T(n) &= \Theta(n^2)
\end{align*}


\begin{align*}
  T(n) &= T(\sqrt{n}) + 1 \\
  T(n) &= T(n^{\frac{1}{2}}) + 1 \\
       &= T(n^{\frac{1}{4}}) + 1 + 1 \\
       &= T(n^{\frac{1}{8}}) + 1 + 1 + 1 \\
       &= T(n^{\frac{1}{\lg i}}) + i \\
       &= \lg n \\
       &= \Theta(\lg n)
\end{align*}

\subsection{Problem 3}
\label{sec:orgheadline10}
Suggest a data-structure with the following properties:
\begin{enumerate}
\item Populate in \(O(n)\) time.
\item Insert in \(O(n \lg n)\) time.
\item Extract minimal element in \(O(\lg n)\) time.
\item Extract median element in \(O(\lg n)\) time.
\item Extract maximal element in \(O(\lg n)\) time.
\end{enumerate}

\subsubsection{Answer 6}
\label{sec:orgheadline9}
There is a simple, but impractical way of doing this---have four heaps:
\begin{itemize}
\item \(A\) is a \texttt{min-heap} containing elements greater than median.
\item \(B\) is a \texttt{max-heap} containing elments smaller than median.
\item \(C\) is a \texttt{max-heap} tracking the heap \(A\).
\item \(D\) is a \texttt{min-heap} tracking the heap \(B\).
\end{itemize}

Creation and insertion are essentially the same as they are in the regular
\texttt{max-heap} and \texttt{mean-heap}.  Median element is either the root of \(A\) or the
root of \(B\), depending on which heap has more elements.  Maximum element is
the root of \(C\) and minimal element is the root of \(D\), so their extraction
is just the glorified \texttt{extract-max} and \texttt{extract-min} correspondingly.

Tracking is achieved using the following mechanism: Each node in each heap
has an additional field that has a position of the tracked node in the other
heap in it.  Once the position of the node is modified, in addition to
\texttt{heapify-min} or \texttt{heapify-max}, the procedure also updates the index in the
tracking node (this takes only constant time).

Whenever a node is deleted, it also needs to be deleted from the tracking
heap.  In this case, the rightmost element in the heap is placed in the cell
previously occupied by the node being deleted.  Then \texttt{heapify-min} or
\texttt{heapify-max} is performed, depending on the kind of heap it was.

Note that this solution is impractical since it requires saving a lot of
additional information, but if we were to relax the requirement of \(O(n)\)
allowing \(O(n \lg n)\) for population, then we could use something like
order-statistic tree.

\subsection{Problem 4}
\label{sec:orgheadline15}
\begin{enumerate}
\item Given binary heap \(A\) of size \(n\) prove that \texttt{extract-max} requires
roughly \(2\lg n\) comparisons.
\item Write an alternative \texttt{extract-max} which only uses \(\lg n + \lg \lg n +
      O(1)\) comparisons.
\item Improve the previous \texttt{extrac-max} s.t. its running time is \(\lg n + \lg
      \lg \lg n + O(1)\) wrt. comparisons.
\item Is it possible to improve this procedure further?  Is it worth it wrt. the
amount of code that it requires?
\end{enumerate}

\subsubsection{Answer 7}
\label{sec:orgheadline11}
First, recall what \texttt{extract-max} looks like:

\begin{algorithm}
  \caption{Running time of extract-max}
  \begin{algorithmic}
    \Procedure {$\textit{extract-max}$}{$heap$}
    \State {$max \leftarrow $}{$heap_0$}
    \State \Call {$size \leftarrow \textit{size}$}{$heap$}
    \State {$last \leftarrow $}{$heap_{size - 1}$}
    \State {$heap_{size - 1} \leftarrow $}{$nil$}
    \State \Call {$\textit{heapify-max}$}{$heap, size - 1$}
    \State \Return {$max$}
    \EndProcedure

    \Procedure {$\textit{heapify-max}$}{$heap, child$}
    \State {$left \leftarrow $}{$child * 2 - 1$}
    \State {$right \leftarrow $}{$child * 2$}
    \State {$parent \leftarrow $}{$child$}
    \State \Call {$size \leftarrow \textit{size}$}{$heap$}
    \If {$left < size \land heap_{left} > heap_{parent}$} \Then
    \State {$parent \leftarrow $}{$left$}
    \EndIf
    \If {$right < size \land heap_{right} > heap_{parent}$} \Then
    \State {$parent \leftarrow $}{$right$}
    \EndIf
    \If {$parent \neq child$} \Then
    \State {$heap_{i},heap_{parent} \leftarrow $}{$heap_{parent},heap_{i}$}
    \State \Call {$\textit{heapify-max}$}{$heap, parent$}
    \EndIf
    \EndProcedure
  \end{algorithmic}
\end{algorithm}

The comparisons all happen inside the \texttt{heapify-max}, notice that it is
called recursively on the problem of size \(n\), splitting it into two
equally-sized portions, and only working on the selected subtree.  It will
only look once at a node at the \(h^s\) level \(h\) being the heights of the
heap.  At each such level it will do five comparisons: two to ensure that
all reads fall within the valid range, two more to find the maximal element
of the parent and its two sibling nodes, and the last one to figure out
whether an additional \texttt{heapify-max} call is required.

Thus, somewhat contrary to conjectured, the number of comparisons required
is actually \(5\lg n\), but only \(2\lg n\) of them are between the members of
the heap (the rest is borders checking).
