assignment-12/assignment.org
*** Answer 8
    The idea is borrowed from Gonnet and Munro:

    #+BEGIN_QUOTE
    Observe that the elements on the path from any node to the root must be in
    sorted order.  Our idea is simply to insert the new element by performing
    the binary search on the path from location $n+1$ to 1.  As this path
    contains $\lceil \log(n + 1) \rceil$ old elements the algorithm will require
    $\lceil \log(\lceil 1 + \log(n + 1)\rceil)\rceil = \lceil \log(\log(2 + 1))
    \rceil$ comparisons in the worst case.  We note that the number of moves
    will be the same as those required in carefully coded standard algorithm.
    #+END_QUOTE

*** Answer 9
    Again, quoting Gonnet and Munro:

    #+BEGIN_QUOTE
    This bound can, however, be improved as follows.  For simplicity assume we
    are removing the maximum and simultaneously inserting a new element.
    #+END_QUOTE

    #+BEGIN_EXAMPLE
    Remove the maximum, creating a "hole" at the top of the heap.

    Find the path of the maximum sons down r levels to some location, say A(i)

    If New element > A(i) Then
      Perform perform a binary search with the new element along the path of
      length r
    Else
      Promote each element on the path to the location of its father and
      recursively apply the method starting at the location A(i).
    #+END_EXAMPLE

*** Answer 10
    The questions of ``practical usefulness'' are very subjective.  The answer
    will depend on multiple factors and the ability to predict the future in
    minor details.  However, it has been shown many times since Williams, Gonnet
    and Munro, Carlsson and many others who worked on optimizing priority
    queues, that binary heaps aren't the best choice of the data-structure for
    this purpose.  Typical requirement for a binary queue is that it perform an
    =insert= in constant time, this already disqualifies binary heaps, where one
    can only hope for amortized constant time.

    The reality of working with large datasets are such that continuous arrays
    are difficult to allocate and access.  Persistency becomes increasingly
    important and so does concurrency.  Binary heaps implemented as arrays don't
    fare very well in this emerging market, so the question of this specific
    optimization is rather pointless.
